#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<string.h>

//杨辉三角
//int main()
//{
//	int a[30][30] = { 0 };
//	int i = 0, j = 0, n = 0;
//	scanf("%d", &n);
//	for (i = 1; i <= n; i++)
//	{
//		a[i][1] = 1;
//		a[i][i] = 1;
//		for (j = 2; j < i; j++)
//		{
//			a[i][j] = a[i - 1][j - 1] + a[i - 1][j];
//		}
//	}
//	for (i = 1; i <= n; i++)
//	{
//		for (j = 1; j <= i; j++)
//		{
//			printf("%5d", a[i][j]);
//		}
//		printf("\n");
//	}
//
//
//	return 0;
//}

//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。
//以下为4个嫌疑犯的供词:
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手。

//int main()
//{
//	char crime = { 0 };
//	for (crime = 'a'; crime <= 'd'; crime++)
//	{
//		if ((crime != 'a') + (crime == 'c') + (crime == 'd') + (crime != 'd') == 3)
//			printf("凶手是%c", crime);
//	}
//
//	return 0;
//}


//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
int main()
{
	char a[5] = { 0 };
	for (a[0] = 'a'; a[0] <= 'e'; a[0]++)
	{
		for (a[1] = 'a'; a[1] <= 'e'; a[1]++)
		{
			if (a[1] == a[0])
				continue;
			for (a[2] = 'a'; a[2] <= 'e'; a[2]++)
			{
				if (a[2] == a[0] || a[2] == a[1])
					continue;
				for (a[3] = 'a'; a[3] <= 'e'; a[3]++)
				{
					if (a[3] == a[0] || a[3] == a[1] || a[3] == a[2])
						continue;
					for (a[4] = 'a'; a[4] <= 'e'; a[4]++)
					{
						if (a[4] == a[0] || a[4] == a[1] || a[4] == a[2] || a[4] == a[3])
							continue;
						if ((((a[1] == 'b') + (a[2] == 'a')) == 1 &&
							((a[1] == 'b') + (a[3] == 'e')) == 1 &&
							((a[0] == 'c') + (a[1] == 'd')) == 1 &&
							((a[4] == 'c') + (a[2] == 'd')) == 1 &&
							((a[3] == 'e') + (a[0] == 'a')) == 1) == 1)
						{
							printf("第一名：%c\n第二名：%c\n第三名：%c\n第四名：%c\n第五名：%c\n", a[0], a[1], a[2], a[3], a[4]);
							goto out;
						}
					}
				}
			}
		}
	}
	out:;
	return 0;
}